Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# AboutRand
source: Returns a random number greater than or equal to 0 and less than 1, evenly distributed.
bg_bg: Връща случайно число, по-голямо от или равно на 0 и по-малко от 1, равномерно разпределено.
ca_es: Retorna un nombre aleatori més gran o igual que 0 i més petit que 1, distribuït de manera uniforme.
cs_cz: Vrátí náhodné číslo větší nebo rovné 0 a menší než 1 určené na základě spojité distribuční funkce.
da_dk: Returnerer et vilkårligt tal, der er større end eller lig med 0 og mindre end 1, jævnt fordelt.
de_de: Gibt eine Zufallszahl zurück, die größer als oder gleich 0 und kleiner als 1 ist, bei gleichmäßiger Verteilung.
el_gr: Επιστρέφει έναν τυχαίο αριθμό μεγαλύτερο από ή ίσο με 0 και μικρότερο από 1, σε ομοιόμορφη κατανομή.
es_es: Devuelve un número aleatorio mayor o igual que 0 y menor que 1 distribuido uniformemente.
et_ee: Tagastab juhusliku arvu, mis on suurem kui null või sellega võrdne ja väiksem kui 1, ühtlaselt jaotatud.
eu_es: 0 baino handiagoa edo berdina den eta 1 baino txikiagoa den ausazko zenbakia itzultzen du, uniformeki banatuta.
fi_fi: Palauttaa satunnaisluvun, joka on suurempi tai yhtä suuri kuin 0 ja pienempi kuin 1 tasaisesti jaeltuna.
fr_fr: Retourne un nombre aléatoire supérieur ou égal à 0 et inférieur à 1, distribué équitablement.
gl_es: Devolve un número aleatorio igual ou maior que 0 e menor que 1, distribuído uniformemente.
hi_in: 0 से बड़ी या बराबर और 1 से छोटी संख्या यादृच्छिक संख्या बराबर वितरित करके लौटाता है.
hr_hr: Vraća jednoliko raspoređeni nasumični broj veći od ili jednak 0 i manji od 1.
hu_hu: Egy 0-val egyenlő vagy nagyobb és 1-nél kisebb véletlenszámot ad eredményül, egyenletes eloszlásban.
it_it: Restituisce un numero casuale uniformemente distribuito e superiore o uguale a 0 e minore di 1.
ja_jp: 0 以上 1 未満の新しい乱数を返します。
kk_kz: 0 мәнінен үлкен немесе оған тең және 1 мәнінен кіші біркелкі үлестірілген кездейсоқ санды қайтарады.
ko_kr: 0보다 크거나 같고 1보다 작은, 균등하게 분포된 난수를 반환합니다.
lt_lt: Pateikia atsitiktinį skaičių, didesnį arba lygų 0 ir mažesnį už 1, tolygiai paskirstytą.
lv_lv: Atgriež gadījumskaitli, kas lielāks vai vienāds ar nulli un mazāks par 1 un ir vienmērīgi sadalīts.
ms_my: Mengembalikan nombor rawak lebih besar daripada atau sama dengan 0 dan kurang daripada 1 yang diagihkan sama rata.
nb_no: Returnerer et tilfeldig tall som er større enn eller lik 0 og mindre enn 1, jevnt fordelt.
nl_nl: Hiermee wordt een gelijkmatig verdeeld willekeurig getal geretourneerd dat groter is dan 0 of gelijk is aan 1.
pl_pl: Zwraca losową liczbę o równomiernym rozkładzie, która jest większa lub równa 0 i mniejsza od 1.
pt_br: Retorna um número aleatório maior ou igual a 0 e menor que 1, distribuído uniformemente.
pt_pt: Devolve um número aleatório igual ou superior a 0 e inferior a 1, distribuído uniformemente.
ro_ro: Returnează un număr aleator mai mare sau egal cu 0 și mai mic decât 1, distribuit uniform.
ru_ru: Возвращает случайное число не меньше 0 и меньше 1 с равномерным распределением.
sk_sk: Vráti náhodné číslo väčšie alebo rovné 0 a menšie ako 1 s rovnomernou distribúciou.
sl_si: Vrne naključno število, večje kot ali enako 0 in manjše kot 1, enakomerno porazdeljeno.
sr_cyrl_rs: Враћа случајни број већи или једнак 0 и мањи од 1, равномерно распоређен.
sr_latn_rs: Vraća slučajni broj veći ili jednak 0 i manji od 1, ravnomerno raspoređen.
sv_se: Returnerar ett slumpmässigt nummer större än eller lika med 0 och mindre än 1, jämt distribuerat.
th_th: ส่งกลับตัวเลขสุ่มที่มากกว่าหรือเท่ากับ 0 และน้อยกว่า 1 กระจายเสมอกัน
tr_tr: 0 ya da 0'dan büyük ve 1'den küçük rastgele bir sayıyı eşit dağıtılmış olarak döndürür.
uk_ua: Повертає рівномірно розподілене довільне число, більше або рівне 0 та менше 1.
vi_vn: Trả về một số ngẫu nhiên lớn hơn hoặc bằng 0 và nhỏ hơn 1, phân bổ đồng đều.
zh_cn: 返回大于或等于 0 并且小于 1 的随机数字(平均分布)。
zh_tw: 傳回大於或等於 0 且小於 1 的均分亂數。

# AboutRandBetween
source: Returns a random number between bottom and top, evenly distributed.
bg_bg: Връща равномерно разпределено случайно число между „долно“ и „горно“.
ca_es: Retorna un nombre aleatori entre el mínim i el màxim, amb una distribució uniforme.
cs_cz: Vrátí náhodné číslo mezi posledním a prvním, rovnoměrně rozložené.
da_dk: Returnerer et tilfældigt tal mellem bund og top, jævnt fordelt.
de_de: Gibt eine zufällige Zahl zwischen unten und oben zurück, gleichmäßig verteilt.
el_gr: Επιστρέφει έναν τυχαίο αριθμό μεταξύ κάτω και επάνω, κατανεμημένου ομοιόμορφα.
es_es: Devuelve un número aleatorio entre inferior y superior, uniformemente distribuido.
et_ee: Tagastab juhusliku arvu suurima ja väikseima vahel, ühtlaselt jaotatuna.
eu_es: Behealdearen eta goialdearen arteko ausazko zenbaki bat itzultzen du, modu uniformean banatuta.
fi_fi: Palauttaa satunnaisen luvun ala- ja yläosan välillä tasaisesti jaettuna.
fr_fr: Retourne un nombre aléatoire entre les derniers et les premiers, distribués de manière égale.
gl_es: Devolve un número aleatorio entre o inferior e o superior, distribuído de xeito uniforme.
hi_in: समान रूप से वितरित, नीचे और ऊपर के बीच की यादिच्छिक संख्या रिटर्न करता है.
hr_hr: Vraća nasumični broj između dna i vrha, ravnomjerno raspoređen.
hu_hu: A legalsó és a legfelső érték közötti, egyenletesen elosztott véletlenszámot ad vissza.
it_it: Restituisce un numero casuale compreso tra quello più alto e quello più basso, distribuiti in modo uniforme.
ja_jp: 最大から最小までに均等に分散した乱数を返します。
kk_kz: Төменгі және жоғарғы арасындағы, біркелкі үлестірілген санды қайтарады.
ko_kr: 균등하게 분포된 하단과 상단 사이의 난수를 반환합니다.
lt_lt: Pateikia tolygiai paskirstytą atsitiktinį skaičių tarp apatinės ir viršutinės verčių.
lv_lv: Atgriež nejaušu skaitli robežās no apakšējā līdz augšējam, vienmērīga sadale.
ms_my: Mengembalikan nombor rawak antara bawah dengan atas, diagihkan dengan sekata.
nb_no: Returnerer et tilfeldig tall mellom bunn og topp, jevnt fordelt.
nl_nl: Retourneert een willekeurig getal tussen het laagste en hoogste getal, gelijkmatig gedistribueerd.
pl_pl: Zwraca liczbę losową z zakresu od wartości dolnej do górnej (równomierne rozłożenie).
pt_br: Retorna um número aleatório entre a parte inferior e a parte superior, distribuído uniformemente.
pt_pt: Devolve um número aleatório entre o inferior e o superior, distribuído uniformemente.
ro_ro: Returnează un număr aleatoriu între jos și sus, distribuit egal.
ru_ru: Возвращает случайное число между нижним и верхним пределом интервала, с равномерным распределением.
sk_sk: Vráti náhodné číslo medzi najnižším a najvyšším s rovnomernou distribúciou.
sl_si: Vrne naključno število med spodnjo in zgornjo vrednostjo, enakomerno porazdeljeno.
sr_cyrl_rs: Даје насумични број између доњег и горњег, равномерно распоређен.
sr_latn_rs: Daje nasumični broj između donjeg i gornjeg, ravnomerno raspoređen.
sv_se: Returnerar ett slumptal mellan lägsta och högsta, jämnt distribuerat.
th_th: ส่งกลับตัวเลขสุ่มระหว่างค่าล่างและค่าบนโดยมีการกระจายอย่างสม่ำเสมอ
tr_tr: Alt ile üst değer arasında, eşit dağıtılmış rastgele bir sayı döndürür.
uk_ua: Повертає випадкове число між нижнім і верхнім числом, рівномірно розподілено.
vi_vn: Trả về một số ngẫu nhiên giữa dưới cùng và trên cùng, phân bổ đều.
zh_cn: 返回介于最小值和最大值之间的随机数(均匀分布)。
zh_tw: 傳回底部和頂部之間的亂數，平均分佈。

# AboutRandBetween_bottom
source: The smallest integer that the function can return.
bg_bg: Най-малкото цяло число, което функцията може да върне.
ca_es: L'enter més petit que la funció pot retornar.
cs_cz: Nejmenší celé číslo, které může funkce vrátit.
da_dk: Det mindste heltal, som funktionen kan returnere.
de_de: Die kleinste ganze Zahl, die die Funktion zurückgeben kann.
el_gr: Ο μικρότερος ακέραιος που μπορεί να επιστρέψει η συνάρτηση.
es_es: El entero menor que la función puede devolver.
et_ee: Väikseim täisarv, mida funktsioon saab tagastada.
eu_es: Funtzioak itzul dezakeen osoko zenbaki baxuena.
fi_fi: Pienin kokonaisluku, jonka toiminto voi palauttaa.
fr_fr: Nombre le plus petit que la fonction puisse retourner.
gl_es: Número enteiro máis pequeno que pode devolver a función.
hi_in: सबसे छोटा पूर्णांक कि फंक्शन रिटर्न हो सकता है.
hr_hr: Najmanji cijeli broj koji funkcija može vratiti.
hu_hu: A legkisebb egész szám, amelyet a függvény visszaadhat.
it_it: Numero intero più piccolo che può essere restituito dalla funzione.
ja_jp: 関数が返す可能性がある最小の整数。
kk_kz: Функция қайтара алатын ең кіші бүтін сан.
ko_kr: 함수가 반환할 수 있는 가장 작은 정수입니다.
lt_lt: Mažiausias sveikasis skaičius, kurį gali pateikti funkcija.
lv_lv: Mazākais veselais skaitlis, ko funkcija var atgriezt.
ms_my: Integer terkecil yang boleh dikembalikan oleh fungsi.
nb_no: Det minste heltallet som funksjonen kan returnere.
nl_nl: Het kleinste geheel getal dat de functie kan retourneren.
pl_pl: Najmniejsza liczba całkowita, jaką może zwrócić funkcja.
pt_br: O menor número inteiro que a função pode retornar.
pt_pt: O menor número inteiro que a função pode devolver.
ro_ro: Cel mai mic întreg pe care îl poate returna funcția.
ru_ru: Наименьшее целое число, которое может вернуть функция.
sk_sk: Najmenšie celé číslo, ktoré môže funkcia vrátiť.
sl_si: Najmanjše celo število, ki ga funkcija lahko vrne.
sr_cyrl_rs: Најмањи цео број који функција може да врати.
sr_latn_rs: Najmanji ceo broj koji funkcija može da vrati.
sv_se: Det minsta heltal som funktionen kan returnera.
th_th: จำนวนเต็มที่น้อยที่สุดที่ฟังก์ชันสามารถส่งกลับได้
tr_tr: İşlevin döndürebileceği en küçük tamsayı.
uk_ua: Найменше ціле число, яке може повернути функція.
vi_vn: Số nguyên nhỏ nhất mà hàm có thể trả về.
zh_cn: 函数可返回的最小整数。
zh_tw: 函數可傳回的最小整數。

# AboutRandBetween_top
source: The largest integer that the function can return. Must be equal to or greater than bottom.
bg_bg: Най-голямото цяло число, което функцията може да върне. Трябва да е по-голямо или равно на „долно“.
ca_es: L'enter més gran que la funció pot retornar. Ha de ser igual o superior al mínim.
cs_cz: Největší celé číslo, které může funkce vrátit. Musí být stejné nebo větší než poslední.
da_dk: Det største heltal, som funktionen kan returnere. Skal være lig med eller større end bunden.
de_de: Die größte ganze Zahl, die die Funktion zurückgeben kann. Muss mindestens so groß wie der untere Wert sein.
el_gr: Ο μεγαλύτερος ακέραιος που μπορεί να επιστρέψει η συνάρτηση. Πρέπει να είναι ίσο ή μεγαλύτερο από το κάτω.
es_es: El entero mayor que puede devolver la función. Debe ser igual o mayor que inferior.
et_ee: Suurim täisarv, mida funktsioon saab tagastada. Peab olema väikseimaga võrdne või suurem.
eu_es: Funtzioak itzul dezakeen osoko zenbaki handiena. Behealdekoaren berdina edo handiagoa izan behar du.
fi_fi: Suurin kokonaisluku, jonka toiminto voi palauttaa. On oltava yhtä suuri tai suurempi kuin alhaalla.
fr_fr: Nombre le plus grand que la fonction puisse retouner. Doit être égal ou supérieur au dernier.
gl_es: Número enteiro máis grande que pode devolver a función. Debe ser igual ou maior que o inferior.
hi_in: सबसे बड़ा पूर्णांक कि फंक्शन रिटर्न हो सकता है. नीचे के बराबर या उससे बड़ा होना चाहिए.
hr_hr: Najveći cijeli broj koji funkcija može vratiti. Mora biti jednak dnu ili veći od njega.
hu_hu: A legnagyobb egész szám, amelyet a függvény visszaadhat. Meg kell egyeznie az alsó értékkel vagy nagyobbnak kell lennie annál.
it_it: Numero intero più grande che può essere restituito dalla funzione. Deve essere uguale o maggiore di quello più basso.
ja_jp: 関数が返す可能性がある最大の整数。必ず最小以上の数になります。
kk_kz: Функция қайтара алатын ең үлкен бүтін сан. Төменгі мәнге тең немесе үлкенірек болуы керек.
ko_kr: 함수가 반환할 수 있는 가장 큰 정수입니다. 같거나 같아야 합니다.
lt_lt: Didžiausias sveikasis skaičius, kurį gali pateikti funkcija. Turi būti lygus apatinei vertei arba už ją didesnis.
lv_lv: Lielākais veselais skaitlis, ko funkcija var atgriezt. Tam ir jābūt vienādam ar apakšējo skaitli vai lielākam par to.
ms_my: Integer terbesar yang boleh dikembalikan oleh fungsi. Mesti sama atau lebih besar daripada bawah.
nb_no: Det største heltallet funksjonen kan returnere. Må være lik eller større enn bunnen.
nl_nl: Het grootste geheel getal dat de functie kan retourneren. Moet gelijk zijn aan of groter zijn dan het laagste getal.
pl_pl: Największa liczba całkowita, jaką może zwrócić funkcja. Musi być równa wartości dolnej lub od niej większa.
pt_br: O maior número inteiro que a função pode retornar. Deve ser igual ou maior que a parte inferior.
pt_pt: O maior número inteiro que a função pode devolver. Tem de ser maior ou igual ao inferior.
ro_ro: Cel mai mare întreg pe care îl poate returna funcția. Trebuie să fie egal sau mai mare decât partea de jos.
ru_ru: Наибольшее число, которое может вернуть функция. Должно быть равно нижнему пределу интервала или больше него.
sk_sk: Najväčšie celé číslo, ktoré môže funkcia vrátiť. Musí byť rovnaké alebo väčšie ako najnižšie.
sl_si: Največje celo število, ki ga funkcija lahko vrne. Mora biti enako ali večje od spodnje vrednosti.
sr_cyrl_rs: Највећи цео број који функција може да врати. Не сме бити мањи од доњег.
sr_latn_rs: Najveći ceo broj koji funkcija može da vrati. Ne sme biti manji od donjeg.
sv_se: Det största heltal som funktionen kan returnera. Måste vara lika med eller större än lägsta.
th_th: จำนวนเต็มที่มากที่สุดที่ฟังก์ชันสามารถส่งกลับได้ ต้องเท่ากับหรือมากกว่าค่าล่าง
tr_tr: İşlevin döndürebileceği en büyük tamsayı. Alt değere eşit veya bu değerden büyük olmalıdır.
uk_ua: Найбільше ціле число, яке може повернути функція. Має дорівнювати або бути більше найменшого числа.
vi_vn: Số nguyên lớn nhất mà hàm có thể trả về. Phải bằng hoặc lớn hơn mức dưới cùng.
zh_cn: 函数可返回的最大整数。必须等于或大于最小值。
zh_tw: 函數可傳回的最大整數。必須等於或大於底部。

# RandBetweenArg1
source: bottom
bg_bg: долно
ca_es: mínim
cs_cz: dolní
da_dk: bund
de_de: unten
el_gr: κάτω
es_es: inferior
et_ee: alla
eu_es: behean
fi_fi: alhaalla
gl_es: inferior
hi_in: नीचे
hr_hr: dno
hu_hu: alsó
it_it: basso
ja_jp: 下
kk_kz: төменгі жақ
ko_kr: 아래쪽
lt_lt: apačia
lv_lv: apakšējais
ms_my: bawah
nb_no: bunn
nl_nl: onder
pl_pl: wartość dolna
pt_br: inferior
pt_pt: inferior
ro_ro: jos
sk_sk: najnižšie
sl_si: spodaj
sr_cyrl_rs: доњи
sr_latn_rs: poslednji
sv_se: lägsta
th_th: ล่าง
tr_tr: alt
uk_ua: найменше число
vi_vn: dưới cùng
zh_cn: 底部
zh_tw: 底部

# RandBetweenArg2
source: top
bg_bg: горно
ca_es: màxim
cs_cz: horní
de_de: oben
el_gr: επάνω
es_es: superior
et_ee: üles
eu_es: goialdea
fi_fi: ylhäällä
gl_es: superior
hi_in: शीर्ष
hr_hr: vrh
hu_hu: felső
it_it: superiore
ja_jp: 上位
kk_kz: жоғарғы жақ
ko_kr: 위쪽
lt_lt: viršus
lv_lv: augšējais
ms_my: atas
nb_no: øverst
nl_nl: boven
pl_pl: wartość górna
pt_br: superior
pt_pt: superior
ro_ro: sus
sk_sk: najvyššie
sl_si: zgoraj
sr_cyrl_rs: горњи
sr_latn_rs: prvi
sv_se: högsta
th_th: บน
tr_tr: üst
uk_ua: найбільше число
vi_vn: trên cùng
zh_cn: 顶部
zh_tw: 頂端

# AboutGUID
source: Creates a GUID from a string, or returns a randomly generated GUID if no arguments are supplied.
bg_bg: Създава GUID от низ или връща случайно генериран GUID, ако няма подадени аргументи.
ca_es: Crea un GUID d'una cadena o retorna un GUID generat aleatòriament si no se subministren arguments.
cs_cz: Vytvoří GUID z řetězce, nebo pokud se nezadají žádné argumenty, vrátí náhodně vygenerované GUID.
da_dk: Opretter et GUID fra en streng, eller returnerer et tilfældigt GUID, hvis der ikke er angivet nogen argumenter.
de_de: Erstellt eine GUID aus einer Zeichenfolge oder gibt eine zufällig generierte GUID zurück, wenn keine Argumente angegeben werden.
el_gr: Δημιουργεί ένα GUID από μια συμβολοσειρά ή επιστρέφει ένα τυχαία δημιουργημένο GUID, αν δεν παρέχονται ορίσματα.
es_es: Crea un GUID a partir de una cadena, o bien devuelve un GUID generado de forma aleatoria si no se proporcionan argumentos.
et_ee: Loob GUID stringist või tagastab juhuslikult loodud GUID, kui argumente pole antud.
eu_es: Kate bateko GUID bat sortzen du, edo ausaz sortutako GUID bat itzultzen du ez bada ematen argumenturik.
fi_fi: Luo GUID-tunnuksen merkkijonosta tai palauttaa satunnaisesti muodostetun GUID-tunnuksen, jos argumentteja on annettu.
fr_fr: Crée un GUID à partir d’une chaîne ou renvoie un GUID généré de façon aléatoire si aucun argument n’est fourni.
gl_es: Crea un GUID a partir dunha cadea ou devolve un GUID xerado aleatoriamente se non se fornece ningún argumento.
hi_in: स्ट्रिंग से एक GUID बनाता है, या यदि कोई भी तर्क नहीं दिया गया है, तो यादृच्छिक रूप से जनरेट किया गया एक GUID लौटाता है.
hr_hr: Stvara GUID iz niza ili vraća slučajno generirani GUID ako nema argumenata.
hu_hu: Létrehoz egy GUID azonosítót egy sztringből, vagy egy véletlenszerűen létrehozott GUID azonosítót ad vissza, ha nincsenek megadva argumentumok.
it_it: Crea un GUID da una stringa o restituisce un GUID generato casualmente se non viene fornito alcun argomento.
ja_jp: 文字列から GUID が作成されるか、引数を指定しない場合はランダムに生成された GUID が返されます。
kk_kz: Жолдан GUID идентификаторын жасайды немесе аргумент берілмесе, кездейсоқ ретпен жасалған GUID идентификаторын қайтарады.
ko_kr: 문자열에서 GUID를 만들거나, 어떤 인수도 제공되지 않는 경우 무작위로 생성된 GUID를 반환합니다.
lt_lt: Iš eilutės sukuriamas GUID arba pateikiamas atsitiktine tvarka sugeneruotas GUID, jei nenurodyta jokių argumentų.
lv_lv: Ja nav norādīts neviens arguments, tiek izveidots identifikators GUID no virknes vai tiek atgriezts nejauši ģenerēts identifikators GUID.
ms_my: Mencipta GUID daripada rentetan atau mengembalikan GUID yang dijana secara rawak jika tiada argumen dibekalkan.
nb_no: Oppretter en GUID fra en streng eller returnerer en tilfeldig generert GUID hvis det ikke er oppgitt noen argumenter.
nl_nl: Hiermee wordt een GUID op basis van een tekenreeks gemaakt of een willekeurig gegenereerde GUID geretourneerd als er geen argumenten zijn opgegeven.
pl_pl: Tworzy identyfikator GUID na podstawie ciągu lub zwraca losowo wygenerowany identyfikator GUID, jeśli nie zostaną podane żadne argumenty.
pt_br: Cria um GUID por meio de uma cadeia de caracteres ou retorna um GUID gerado aleatoriamente caso nenhum argumento seja fornecido.
pt_pt: Cria um GUID a partir de uma cadeia ou devolve um GUID gerado aleatoriamente se não forem fornecidos argumentos.
ro_ro: Creează un GUID dintr-un șir de caractere sau returnează un GUID generat aleator dacă nu s-au furnizat argumente.
ru_ru: Создает GUID из строки или возвращает случайный созданный GUID, если не предоставлены аргументы.
sk_sk: Vytvorí identifikátor GUID z reťazca alebo ak nie sú zadané žiadne argumenty, vráti náhodne vygenerovaný identifikátor GUID.
sl_si: Ustvari GUID iz niza ali pa vrne naključno ustvarjene GUID-je, če niso navedeni nobeni argumenti.
sr_cyrl_rs: Прави GUID од ниске или враћа насумично генерисани GUID ако није наведен ниједан аргумент.
sr_latn_rs: Pravi GUID od niske ili vraća nasumično generisani GUID ako nije naveden nijedan argument.
sv_se: Skapar ett GUID från en sträng eller returnerar ett slumpmässigt genererat GUID om inga argument har angetts.
th_th: สร้าง GUID จากสตริง หรือส่งกลับเป็น GUID ที่สร้างขึ้นแบบสุ่มถ้าไม่มีการจัดอาร์กิวเมนต์ให้
tr_tr: Bir dizeden GUID oluşturur veya bağımsız değişken sağlanmadıysa rastgele oluşturulmuş bir GUID döndürür.
uk_ua: Створює GUID з рядка або повертає випадковий GUID, якщо аргументів не надано.
vi_vn: Tạo GUID từ một chuỗi hoặc trả về GUID được tạo ngẫu nhiên nếu không cung cấp đối số.
zh_cn: 从字符串创建 GUID，或者如果未提供参数，则返回随机生成的 GUID。
zh_tw: 從字串建立 GUID，若未提供引數則傳回隨機產生的 GUID。

# GUIDArg
source: GUID_string
bg_bg: Низ_към_GUID
ca_es: cadena_GUID
cs_cz: řetězec_GUID
da_dk: GUID_streng
de_de: GUID_Zeichenfolge
el_gr: συμβολοσειρά_GUID
es_es: cadena_GUID
eu_es: GUID_katea
fi_fi: GUID_merkkijono
fr_fr: chaîne_GUID
gl_es: cadea_GUID
hi_in: GUID_स्ट्रिंग
hr_hr: GUID_niz
hu_hu: GUID_sztring
it_it: Stringa_GUID
ja_jp: GUID_文字列
kk_kz: GUID_жол
ko_kr: GUID_스트링
lt_lt: GUID_eilutė
lv_lv: GUID_virkne
ms_my: rentetan_GUID
nb_no: GUID_streng
pl_pl: ciąg_GUID
pt_br: cadeia_GUID
pt_pt: cadeia_GUID
ro_ro: șir_GUID
ru_ru: GUID_строка
sk_sk: reťazec_GUID
sl_si: GUID_niz
sr_cyrl_rs: GUID_ниска
sr_latn_rs: GUID_niska
sv_se: GUID_sträng
th_th: GUID_สตริง
tr_tr: GUID_dizesi
uk_ua: рядок_GUID
vi_vn: Chuỗi_GUID
zh_cn: GUID_字符串

# AboutGUID_GUID_string
source: String to convert into a GUID
bg_bg: Низ за конвертиране в GUID
ca_es: Cadena per fer la conversió a un GUID
cs_cz: Řetězec, který se má převést na GUID
da_dk: Streng, der skal konverteres til et GUID
de_de: Zeichenfolge, die in eine GUID konvertiert werden soll
el_gr: Συμβολοσειρά για μετατροπή σε GUID
es_es: Cadena que debe convertirse a un GUID
et_ee: String, mida teisendada GUID-ks
eu_es: GUID bihurtuko den katea
fi_fi: GUID-tunnukseksi muunnettava merkkijono
fr_fr: Chaîne à convertir en GUID
gl_es: Cadea para converter nun GUID
hi_in: किसी GUID में रूपांतरित करने के लिए स्ट्रिंग
hr_hr: Niz koji je potrebno pretvoriti u GUID
hu_hu: A GUID azonosítóvá alakítandó sztring
it_it: Stringa da convertire in GUID
ja_jp: GUID に変換する文字列
kk_kz: GUID етіп түрлендіру жолы
ko_kr: GUID로 변환할 문자열
lt_lt: Eilutė, kurią reikia konvertuoti į GUID
lv_lv: Virkne, ko pārvērst identifikatorā GUID
ms_my: Rentetan untuk menukar kepada GUID
nb_no: Strengen som skal konverteres til en GUID
nl_nl: Tekenreeks die naar een GUID moet worden geconverteerd
pl_pl: Ciąg do przekonwertowania na identyfikator GUID
pt_br: Cadeia de caracteres a ser convertida em um GUID
pt_pt: Cadeia para converter em GUID
ro_ro: Șirul de convertit într-un GUID
ru_ru: Строка для преобразования в GUID
sk_sk: Reťazec, ktorý sa má skonvertovať na identifikátor GUID
sl_si: Niz, ki bo pretvorjen v GUID
sr_cyrl_rs: Ниска за конвертовање у GUID
sr_latn_rs: Niska za konvertovanje u GUID
sv_se: Sträng som ska konverteras till ett GUID
th_th: สตริงที่จะแปลงเป็น GUID
tr_tr: GUID'ye dönüştürülecek dize
uk_ua: Рядок для перетворення на GUID
vi_vn: Chuỗi để chuyển đổi thành GUID
zh_cn: 要转换为 GUID 的字符串
zh_tw: 要轉換成 GUID 的字串

# AboutNow
source: Returns the current date and time.
bg_bg: Връща текущата дата и час.
ca_es: Retorna la data i l'hora actual.
cs_cz: Vrátí aktuální datum a čas.
da_dk: Returnerer den aktuelle dato og klokkeslæt.
de_de: Gibt den aktuellen Wert für Datum und Uhrzeit zurück.
el_gr: Επιστρέφει την τρέχουσα ημερομηνία και ώρα.
es_es: Devuelve la fecha y la hora actuales.
et_ee: Tagastab praeguse kuupäeva ja kellaaja.
eu_es: Uneko data eta ordua itzultzen ditu.
fi_fi: Palauttaa nykyisen päivämäärän ja ajan.
fr_fr: Retourne la date et l’heure actuelles.
gl_es: Devolve a data e hora actuais.
hi_in: वर्तमान दिनांक और समय लौटाता है.
hr_hr: Vraća trenutni datum i vrijeme.
hu_hu: A pontos időt és a dátumot adja eredményül.
it_it: Restituisce la data e l'ora correnti.
ja_jp: 現在の日付と時刻を返します。
kk_kz: Ағымдағы күн мен уақытты қайтарады.
ko_kr: 현재 날짜 및 시간을 반환합니다.
lt_lt: Pateikia dabartinę datą ir laiką.
lv_lv: Atgriež pašreizējo datumu un laiku.
ms_my: Mengembalikan tarikh dan masa semasa.
nb_no: Returnerer gjeldende dato og klokkeslett.
nl_nl: Hiermee worden de huidige datum en tijd geretourneerd.
pl_pl: Zwraca bieżącą datę i godzinę.
pt_br: Retorna a data e a hora atuais.
pt_pt: Devolve a data e hora atuais.
ro_ro: Returnează data și ora curente.
ru_ru: Возвращает текущую дату и время.
sk_sk: Vráti aktuálny dátum a čas.
sl_si: Vrne trenutni datum in uro.
sr_cyrl_rs: Враћа тренутни датум и време.
sr_latn_rs: Vraća trenutni datum i vreme.
sv_se: Returnerar nuvarande datum och tid.
th_th: ส่งกลับค่าวันที่และเวลาปัจจุบัน
tr_tr: Geçerli tarihi ve saati döndürür.
uk_ua: Повертає поточні дату та час.
vi_vn: Trả về ngày và giờ hiện tại.
zh_cn: 返回当前日期和时间。
zh_tw: 傳回目前的日期與時間。
